Revit 2024 API
MEPSystem.IsMultipleNetwork Property
 Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsMultipleNetwork { get; }
Visual Basic
Public ReadOnly Property IsMultipleNetwork As Boolean
	Get
Visual C++
public:
property bool IsMultipleNetwork {
	bool get ();
}
See Also
MEPSystem Class
Autodesk.Revit.DB Namespace